In [2]:
import pandas as pd

In [3]:
data = [[3, 'Brad', None, 4000], [1, 'John', 3, 1000], [2, 'Dan', 3, 2000], [4, 'Thomas', 3, 4000]]
employee = pd.DataFrame(data, columns=['empId', 'name', 'supervisor', 'salary']).astype({'empId':'Int64', 'name':'object', 'supervisor':'Int64', 'salary':'Int64'})
data = [[2, 500], [4, 2000]]
bonus = pd.DataFrame(data, columns=['empId', 'bonus']).astype({'empId':'Int64', 'bonus':'Int64'})

In [4]:
employee

   empId    name  supervisor  salary
0      3    Brad        <NA>    4000
1      1    John           3    1000
2      2     Dan           3    2000
3      4  Thomas           3    4000

In [5]:
bonus

   empId  bonus
0      2    500
1      4   2000

In [14]:
result = employee.merge(right=bonus[["empId", "bonus"]],how="left", on="empId")

In [15]:
result

   empId    name  supervisor  salary  bonus
0      3    Brad        <NA>    4000   <NA>
1      1    John           3    1000   <NA>
2      2     Dan           3    2000    500
3      4  Thomas           3    4000   2000

In [38]:
result.where((result["bonus"] < 1000) | (result["bonus"].isna()))[["name", "bonus"]]

   name  bonus
0  Brad   <NA>
1  John   <NA>
2   Dan    500
3   NaN   <NA>

In [32]:
failed_testcase = {
    "empId": [3, 1, 2, 4],
    "name": [None, "John", "Dan", "Thomas"],
    "supervisor": [None, 3, 3, 3],
    "salary": [4000, 1000, 2000, 4000]
}
failed_testcase = pd.DataFrame(failed_testcase)

In [33]:
failed_testcase

   empId    name  supervisor  salary
0      3    None         NaN    4000
1      1    John         3.0    1000
2      2     Dan         3.0    2000
3      4  Thomas         3.0    4000

In [37]:
bonus

   empId  bonus
0      2    500
1      4   2000

In [41]:
def employee_bonus(employee: pd.DataFrame, bonus: pd.DataFrame) -> pd.DataFrame:
    result = employee.merge(bonus, on="empId", how="left")
    return result.loc[(result["bonus"] < 1000) | (result["bonus"].isna()), ["name", "bonus"]]

In [42]:
employee_bonus(failed_testcase, bonus)

   name  bonus
0  None   <NA>
1  John   <NA>
2   Dan    500